# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
depth_multiple: 0.50 # model depth multiple
width_multiple: 0.50 # layer channel multiple
# anchors:
#   - [10, 13, 16, 30, 33, 23] # P3/8
#   - [30, 61, 62, 45, 59, 119] # P4/16
#   - [116, 90, 156, 198, 373, 326] # P5/32
anchors:
  - [21,41, 23,55, 32,67]        # P3/8
  - [40,89, 47,113, 134,42]      # P4/16
  - [60,145, 195,55, 83,208]     # P5/32

# YOLO12n backbone
backbone:
  [
    # Block 1
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC3k2, [128]], # 2-P2/4
    [[-1], 1, GPT, [128]], # 3-P2/4
    [[2, 3], 1, Add2, [128, 0]], # 4-P2/4 stream one
    [[2, 3], 1, Add2, [128, 1]], # 5-P2/4 stream two

    # Block 2
   # stream one
    [4, 1, Conv, [256, 3, 2]],  # 6-P3/8
    [-1, 9, C3k2, [256, False, 0.25]],   # 7-P3/8
   # stream two
    [5, 1, Conv, [256, 3, 2]],  # 8-P3/8
    [-1, 9, C3k2, [256, 3, 2]],   # 9-P3/8
   # transformer fusion
    [[7,9], 1, GPT, [256]],   # 10-P3/8
    [[7, 10], 1, Add2, [256, 0]],    # 11-P3/8 stream one
    [[9, 10], 1, Add2, [256, 1]],    # 12-P3/8 stream two

    # Block 3
   # stream one
    [11, 1, Conv, [512, 3, 2]],   # 13-P4/16
    [-1, 9, C3k2, [512, False, 0.25]],   # 14-P4/16
   # stream two
    [12, 1, Conv, [512, 3, 2]],   # 15-P4/16
    [-1, 9, C3k2, [512, False, 0.25]],   # 16-P4/16
   # transformer fusion
    [[14,16], 1, GPT, [512]],   # 17-P3/8
    [[14,17], 1, Add2, [512, 0]],    # 18-P4/16 stream one
    [[16,17], 1, Add2, [512, 1]],    # 19-P4/16 stream two

    ######### TransformerBlock Four #############
    # stream one
    [18, 1, Conv, [1024, 3, 2]],    # 20-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]],   # 21-P5/32
    [-1, 3, C3k2, [1024, False, 0.25]],   # 22-P5/32
    # stream two
    [19, 1, Conv, [1024, 3, 2]],    # 23-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]],   # 24-P5/32
    [-1, 3, C3, [1024, False]],   # 25-P5/32
    # transformer fusion
    [[22,25], 1, GPT, [1024]],    # 26-P5/32
    [[22,26], 1, Add2, [1024, 0]],    # 27-P5/32 stream one
    [[25,26], 1, Add2, [1024, 1]],    # 28-P5/32 stream two


    ######### Add Block #############
    [[11,12], 1, Add, [1]],   # 29-P3/8 fusion backbone P3
    [[18,19], 1, Add, [1]],   # 30-P4/16 fusion backbone P4
    [[27,28], 1, Add, [1]],   # 31-P5/32 fusion backbone P5
  ]

# YOLO12n head
head:
  [
    [-1, 1, Conv, [512, 1, 1]], # 32
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 33
    [[-1, 30], 1, Concat, [1]], # 34 cat backbone P4
    [-1, 2, A2C2f, [512, False, -1]], # 35

    [-1, 1, Conv, [256, 1, 1]],   # 36
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 37
    [[-1, 29], 1, Concat, [1]], # 38 cat backbone P3
    [-1, 2, A2C2f, [256, False, -1]], # 39 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]], # 40
    [[-1, 36], 1, Concat, [1]], # 41 cat head P4
    [-1, 2, A2C2f, [512, False, -1]], # 42 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]], # 43
    [[-1, 32], 1, Concat, [1]], # 44 cat head P5
    [-1, 2, C3k2, [1024, True]], # 45 (P5/32-large)

    [[39, 42, 45], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]