# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.25 # layer channel multiple
max_channel: 1024
# anchors:
#   - [10, 13, 16, 30, 33, 23] # P3/8
#   - [30, 61, 62, 45, 59, 119] # P4/16
#   - [116, 90, 156, 198, 373, 326] # P5/32
anchors:
  - [21,41, 23,55, 32,67]        # P3/8
  - [40,89, 47,113, 134,42]      # P4/16
  - [60,145, 195,55, 83,208]     # P5/32
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC2f, [128, True]],
    [-1, 1, Fusion, ['concat', 2]],
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, Conv, [256, 3, 2]], # 5-P3/8
    [-1, 6, C2f, [256, True]],
    [-1, 1, Conv, [512, 3, 2]], # 7-P4/16
    [-1, 6, C2f, [512, True]],
    [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
    [-1, 3, C2f, [1024, True]],
    [-1, 1, SPPF, [1024, 5]], # 11
  ]

# YOLOv5 v6.0 head
head: [
    # [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 8], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C2f, [512]], # 14

    # [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C2f, [256]], # 17 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C2f, [512]], # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 11], 1, Concat, [1]], # cat head P5
    [-1, 3, C2f, [1024]], # 23 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
