# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
depth_multiple: 0.50 # model depth multiple
width_multiple: 0.50 # layer channel multiple

# anchors:
#   - [10, 13, 16, 30, 33, 23] # P3/8
#   - [30, 61, 62, 45, 59, 119] # P4/16
#   - [116, 90, 156, 198, 373, 326] # P5/32
anchors:
  - [21,41, 23,55, 32,67]        # P3/8
  - [40,89, 47,113, 134,42]      # P4/16
  - [60,145, 195,55, 83,208]     # P5/32

# YOLO12n backbone
backbone:
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC3k2, [128, False, 0.25]],
    [-1, 1, Fusion, ['concat', 2]],
    # [-1, 1, Conv, [64, 3, 2]], # 0-P1/2
    # [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 2, C3k2, [256, False, 0.25]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 2, C3k2, [512, False, 0.25]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 4, A2C2f, [512, True, 6]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 4, A2C2f, [1024, True, 1]], # 8
  ]
  
# YOLO12n head
head:
  [
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4
    [-1, 2, A2C2f, [512, False, -1]], # 13

    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3
    [-1, 2, A2C2f, [256, False, -1]], # 16

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 13], 1, Concat, [1]], # cat head P4
    [-1, 2, A2C2f, [512, False, -1]], # 19

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 2, C3k2, [1024, True]], # 22 (P5/32-large)

    [[16, 19, 22], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]